package Lesson;

public class L0113B {

	public static void main(String[] args) {
		
		
//		데이터 타입 : 변수에 저장될 데이터의 형식
//
//		변수 : 변하는 값
//
//		int a = 4;
//		정수형 변수 a를 선언하고 4를 할당한다.
//
//		예약어 : int, char 등과 같이 이미 자바에서 문법적으로 
//		사용되고 있는 단어를 예약어 -> 변수 이름 사용 x
//
//		컴퓨터에서 가장 작은 단위 : 비트(bit)
		// 10.0 
		// 실수의 기본 데이터 타입 : double 형 
//		float a = 10.0F;
//		System.out.println(a);
		
//		double a = 10.0;
//		System.out.println(a);
		
//		char grade = 'A';
//		System.out.println(grade);
		
//		String grade = "A"; // 문자열 -> 큰따옴표 
//		System.out.println(grade);
		
		/*
		 * 문자열 : String = 문자 + 문자 
		 * 문자 'A' -> 2byte
		 * 
		 * 문자열 "AB" = 'A' + 'B'
		 * 2byte + 2byte = 4 byte
		 * 
		 * "ABC" = 'A' + 'B' + 'C' = 6byte 
		 * */
		
		
		/* byte 
		 * 1. "안녕" 
		 * 4
		 * 
		 * 2. "Hello" 
		 * 10
		 * 
		 * 3. "A"
		 * 2
		 * 
		 * 4. 'A'
		 * 2
		 * 
		 * 
		 * */
		
		
//		String a = "Hello";
//		System.out.println(a); // Hello 
//		
//		
//		String b = "H";
//		System.out.println(b);
		
		/* 
		 * 출력
		 * A // 문자 
		 * AB
		 * apple
		 * Hello Java
		 * 
		 * 
		 * 
		 * 
		 * */
		
//		정수형 : 정수(소수점 없는 수) 저장할 때 사용
//
//		byte : 1 byte
//		short : 2 byte
//		int : 4 byte(가장 많이 사용되는 타입)
//		long : 8 byte
//
//		Q. 4를 할당하고 출력하시오.
//
//		int a = 4;
//		System.out.println(a); // 4
//
//		문제
//		프로그램을 작성하시오.
//
//		조건
//		1. 정수 10이 할당되어 있는 변수, + 연산자를 활용하시오.
//
//		출력
//		10
//		20
//		30
//
//
//		변수 a, b가 컴퓨터상에서 소모하는 메모리의 양은 같을까요?
//		long a = 2023487647;
//		long b = 1;
//
//		정답
//		할당되어 있는 값이 다르더라도 데이터 타입이 같다면
//		소모하는 메모리의 양은 같다.
//
//		--------------------------
//		변수 a, b가 컴퓨터 상에서 소모하는 메모리의 양은 같을까요?
//
//		int a = 2024;
//		long b = 2024;
//		-----------------------
//		문제
//		변수를 활용하여 두 값을 출력하는 프로그램을 작성하시오.
//
//		조건
//		1. 출력 사이에는 공백이 존재한다.
//
//		출력
//		4 5
//
//		------
//		문제
//		변수에 각각 5, 7를 할당하고 
//		다음과 같은 출력이 나오도록 프로그램을 작성하시오.
//
//		출력
//		가을이와 겨울이를 소개하겠습니다!
//		가을이의 나이는 7살이고 겨울이의 나이는 5살입니다.
//
//		-------------
//		문제
//		변수에 10, 20을 할당하고 프로그램을 작성하시오.
//
//		출력
//		a : 10
//		b : 20
//
//
//		-----------
//		문제
//		변수에 3, 5를 할당하고 프로그램을 작성하시오.
//
//		출력
//		가을이의 인형은 3이고 겨울이의 인형은 5이다.
//		가을이와 겨울이는 인형을 8개 갖고 있다.
//		------------
//		문제
//		변수에 100, 150을 할당하고 프로그램을 작성하시오.
//
//		출력
//		a의 값은 100
//		b의 값은 150
//		a와 b의 합은 250
//		a와 b의 차는 -50
//
//
//		실수형 데이터 타입
//		float 4byte
//		double 8byte(가장 많이 사용)
//
//		문제
//		프로그램을 작성하시오.
//
//		출력
//		[A의 신체 정보]
//		키 : 185.7
//		몸무게 : 60.4
//
//		------
//		문제
//		프로그램을 작성하시오.
//
//		출력
//		x : 3.18
//		y : 2.5
//		x와 y의 합은 5.68
//
//		------
//		복습 퀴즈
//
//		1. 문자의 의미와 어떤 기호를 사용하는지 작성하시오.
//
//		2. 문자열의 의미와 어떤 기호를 사용하는지 작성하시오.
//
//		3. 문자인지 문자열인지 말하시오.(이유도 함께 말하시오.)
//		1) 'A' :
//		2) "A" :
//		3) 'AB' :
//		4) "Hello Java" : 
//
//		문자형
//		char : 한 글자인 문자를 작은따옴표로 감싼 값 할당
//
//		대문자 A : 65
//		소문자 a : 97
//

		
		
		

	}

}
